Autodesk.Revit.DB.ITransactionFinalizerProxy.OnRolledBack(Autodesk.Revit.DB.Document,System.String)
This method is called at the end of rolling back a transaction
document:
The document associated with the transaction
strTransactionName:
The transaction's name
Since:
2011

Autodesk.Revit.DB.ITransactionFinalizerProxy.OnCommitted(Autodesk.Revit.DB.Document,System.String)
This method is called at the end of committing a transaction
document:
The document associated with the transaction
strTransactionName:
The transaction's name
Since:
2011